In [2]:
import pandas as pd
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [4]:
us_weather=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[21,35,33],
    "humidity":[68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           35        65
2   orlando           33        75

In [13]:
df=pd.concat([india_weather,us_weather],keys=["india","US"])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
US    0   new york           21        68
      1    chicago           35        65
      2    orlando           33        75

In [18]:
df.loc["US"]

       city  temperature  humidity
0  new york           21        68
1   chicago           35        65
2   orlando           33        75

In [25]:
windspeed_df = pd.DataFrame({"city":["delhi","mumbai","bangalore"],
                             "windspeed":[7,12,18]
                            },index=[2,1,0]
                           )
windspeed_df

        city  windspeed
2      delhi          7
1     mumbai         12
0  bangalore         18

In [6]:
temperature_df = pd.DataFrame({"city":["delhi","mumbai","banglore"],
                             "temperature":[32,45,30]})
temperature_df

       city  temperature
0     delhi           32
1    mumbai           45
2  banglore           30

In [12]:
result=pd.concat([temperature_df,windspeed_df],axis=1)  #concatenate along column i.e side by side and remove duplicates
result=result.loc[:,~result.columns.duplicated()]
result

       city  temperature  windspeed
0     delhi           32       12.0
1    mumbai           45        7.0
2  banglore           30        NaN

In [31]:
new_df=pd.merge(temperature_df,windspeed_df,on="city",how="outer") #like sql join

In [40]:
new_df.fillna({col:round(new_df[col].mean(),2) for col in new_df.columns if col!="city"})

        city  temperature  windspeed
0  bangalore        35.67      18.00
1   banglore        30.00      12.33
2      delhi        32.00       7.00
3     mumbai        45.00      12.00